/* Case 2
Дано целое число K. Вывести строку-описание оценки, соответствующей числу K 
(1 — «плохо», 2 — «неудовлетворительно», 3 — «удовлетворительно», 4 — «хорошо», 
5 — «отлично»). Если K не лежит в диапазоне 1–5, то вывести строку «ошибка». */

// Користувач вводить число від 1 до 5
let K = parseInt(prompt("Введіть оцінку від 1 до 5"))

// В залежності від того, яке число ввів користувач, виконується відповідний блок кода
switch(K) {
    case 1 : alert('Погано')
        break
    case 2 : alert('Незадовільно')
        break
    case 3 : alert('Задовільно')
        break
    case 4 : alert('Добре')
        break
    case 5 : alert('Відмінно')
        break
    default : alert('Помилка')
}