/* Case 1
Дано целое число в диапазоне 1–7. Вывести строку — название дня недели, 
соответствующее данному числу (1 — «понедельник», 2 — «вторник» и т. д.). */

// Користувач вводить число від 1 до 7
let day = parseInt(prompt("Введіть число від 1 до 7"))

// В залежності від того, яке число ввів користувач, виконується відповідний блок кода
switch(day) {
    case 1 : alert('Понеділок')
        break
    case 2 : alert('Вівторок')
        break
    case 3 : alert('Середа')
        break
    case 4 : alert('Четвер')
        break
    case 5 : alert('Пятниця')
        break
    case 6 : alert('Субота')
        break
    case 7 : alert('Неділя')
        break
    default : alert('Введено невірне число')
}