let C = prompt('Введіть початкове положення Робота : П якщо північ; З якщо захід; Ю якщо південь; С якщо схід');

let N = parseInt(prompt('Введіть команду 0 якщо треба продовжити рух; 1 якщо повернути на ліво; -1 якщо треба повернути на право'));

if (C == 'П') {
    switch (N) {
        case 0 : alert('Робот рухається на північ');
        case 1 : alert('Робот змінив напрямок на захід');
        case -1 : alert('Робот робот змінив напрямок на схід');
            break;
        default : alert('Помилка');
    } 
} else if (C == 'З') {
    switch (N) {
        case 0 : alert('Робот рухається на захід');
        case 1 : alert('Робот змінив напрямок на південь');
        case -1 : alert('Робот змінив напрямок на північ');
            break;
        default : alert('Помилка');
    }
} else if (C == 'Ю') {
    switch (N) {
        case 0 : alert('Робот рухається на південь');
        case 1 : alert('Робот змінив напрямок на схід');
        case -1 : alert('Робот змінив напрямок на захід');
            break;
        default : alert('Помилка');
    }
} else if (C == 'С') {
    switch (N) {
        case 0 : alert('Робот рухається на схід');
        case 1 : alert('Робот змінив напрямок на північ');
        case -1 : alert('Робот змінив напрямок на південь');
            break;
        default : alert('Помилка');
    }
} else {
    alert('Помилка');
}