let C = prompt('Введіть початкову орієнтацію локатора : П якщо північ ; З якщо захід; Ю якщо південь; С якщо схід');

let N1 = parseInt(prompt('Введіть команду 1 якщо треба повернути на ліво; -1 якщо повернути на право; 2 якщо треба повернути на 180 градусів'));

let N2 = parseInt(prompt('Введіть команду 1 якщо треба повернути на ліво; -1 якщо повернути на право; 2 якщо треба повернути на 180 градусів'));
/*
if (N1 == 1 && N2 == 1) {
    switch (C) {
        case 'П' : alert('Локатор напавлений на південь');
        case 'З' : alert('Локатор напрвлений на схід');
        case 'Ю' : alert('Локатор направлений на північ');
        case 'С' : alert('Локатор направлений на захід');
            break;
        default : alert('Помилка')
    }
} if else (N1 == 1 && N2 == -1 || N1 == -1 && N2 == 1) */

let N3 = N1 + N2
let I = 0

switch (C) {
    case "П" : I = 0;
        break;
    case "З" : I = 1;
        break;
    case "Ю" : I = 2;
        break;
    case "С" : I = 3;
        break;
}

N3 = N3 + I

switch(N3) {
    case 0 : case 4 : alert('Локатор направлений на північ');
        break;
    case 1 : case 5 : alert('Локатор направлений на захід');
        break;
    case 2 : case -2 : case 6 : alert('Локатор направлений на південь');
        break;
    case 3 : case -1 : case 7 : alert('Локатор направлений на схід');
        break;
}